---
kind: property
id: P:Autodesk.Revit.DB.SiteLocation.GeoCoordinateSystemDefinition
source: html/088afc2a-b150-9d1e-4af8-319acad99828.htm
---
# Autodesk.Revit.DB.SiteLocation.GeoCoordinateSystemDefinition Property

The XML string which describes the geographic coordinate system.

## Syntax (C#)
```csharp
public string GeoCoordinateSystemDefinition { get; }
```

## Remarks
If the site does not have a geographic coordinate system, it returns an empty string for this property.